wwng2333/ChibiOS-Contrib/os/common/ext/CMSIS/HT32F165x/ht32f1655_reg.h
#ifndef HT32F1655_H
#define HT32F1655_H

#include "ht32f165x_reg.h"

// Peripherals
// ////////////////////////////////////////////////////////////////////////////////////////////////
#define GPIO_A          0
#define GPIO_B          1
#define GPIO_C          2
#define GPIO_D          3
#define GPIO_E          4

#define CLOCK_PA        TYPE_AHB | (1 << 16)
#define CLOCK_PB        TYPE_AHB | (1 << 17)
#define CLOCK_PC        TYPE_AHB | (1 << 18)
#define CLOCK_PD        TYPE_AHB | (1 << 19)
#define CLOCK_PE        TYPE_AHB | (1 << 20)

// Clock Control Unit
// ////////////////////////////////////////////////////////////////////////////////////////////////
#define CKCU_GCFGR      CKCU_BASE + 0x0     // Global Clock Configuration
#define CKCU_GCCR       CKCU_BASE + 0x4     // Global Clock Control
#define CKCU_GCSR       CKCU_BASE + 0x8     // Global Clock Status
#define CKCU_GCIR       CKCU_BASE + 0xC     // Global Clock Interrupt

#define CKCU_PLLCFGR    CKCU_BASE + 0x18    // PLL Configuration
#define CKCU_PLLCR      CKCU_BASE + 0x1C    // PLL Control
#define CKCU_AHBCFGR    CKCU_BASE + 0x20    // AHB Configuration
#define CKCU_AHBCCR     CKCU_BASE + 0x24    // AHB Clock Control
#define CKCU_APBCFGR    CKCU_BASE + 0x28    // APB Configuration
#define CKCU_APBCCR0    CKCU_BASE + 0x2C    // APB Clock Control 0
#define CKCU_APBCCR1    CKCU_BASE + 0x30    // APB Clock Control 1
#define CKCU_CKST       CKCU_BASE + 0x34    // Clock Source Status

#define CKCU_LPCR       CKCU_BASE + 0x300   // Low Power Control
#define CKCU_MCUDBGCR   CKCU_BASE + 0x304   // MCU Debug Control

// GCFGR
STRUCT_REGISTER_START {
    u32 CKOUTSRC    : 3;    //!< CKOUT Clock Source Selection
    u32             : 5;
    u32 PLLSRC      : 1;    //!< PLL Clock Source Selection
    u32             : 2;
    u32 CKREFPRE    : 5;    //!< CK_REF Clock Prescaler Selection
    u32             : 4;
    u32 URPRE       : 2;    //!< USART Clock Prescaler Selection
    u32 USBPRE      : 2;    //!< USB Clock Prescaler Selection
    u32             : 5;
    u32 LPMOD       : 3;    //!< Lower Power Mode Status
} STRUCT_REGISTER_END GCFGR_reg;
STRUCT_SIZE_ASSERT(GCFGR_reg, 4);

// GCCR
STRUCT_REGISTER_START {
    u32 SW          : 2;    //!< System Clock Switch
    u32             : 7;
    u32 PLLEN       : 1;    //!< PLL Enable
    u32 HSEEN       : 1;    //!< External High Speed Oscillator Enable
    u32 HSIEN       : 1;    //!< Internal High Speed Oscillator Enable
    u32             : 4;
    u32 CKMEN       : 1;    //!< HSE Clock Monitor Enable
    u32 PSRCEN      : 1;    //!< Power Saving Wakeup RC Clock Enable
    u32             : 14;
} STRUCT_REGISTER_END GCCR_reg;
STRUCT_SIZE_ASSERT(GCCR_reg, 4);

// GCSR
STRUCT_REGISTER_START {
    u32             : 1;
    u32 PLLRDY      : 1;    //!< PLL Clock Ready Flag
    u32 HSERDY      : 1;    //!< HSE High Speed External Oscillator Ready Flag
    u32 HSIRDY      : 1;    //!< HSI High Speed Internal Oscillator Ready Flag
    u32 LSERDY      : 1;    //!< LSE External Low Speed Oscillator Ready Flag
    u32 LSIRDY      : 1;    //!< LSI Internal Low Speed Oscillator Ready Flag
    u32             : 26;
} STRUCT_REGISTER_END GCSR_reg;
STRUCT_SIZE_ASSERT(GCSR_reg, 4);

// GCIR
STRUCT_REGISTER_START {
    u32 CKSF        : 1;    //!< HSE Clock Stuck Interrup Flag
    u32             : 1;
    u32 PLLRDYF     : 1;    //!< PLL Ready Interrupt Flag
    u32 HSERDYF     : 1;    //!< HSE Ready Interrupt Flag
    u32 HSIRDYF     : 1;    //!< HSI Ready Interrupt Flag
    u32 LSERDYF     : 1;    //!< LSE Ready Interrupt Flag
    u32 LSIRDYF     : 1;    //!< LSI Ready Interrupt Flag
    u32             : 9;
    u32 CKSIE       : 1;    //!< Clock Stuck Interrupt Enable
    u32             : 1;
    u32 PLLRDYIE    : 1;    //!< PLL Ready Interrupt Enable
    u32 HSERDYIE    : 1;    //!< HSE Ready Interrupt Enable
    u32 HSIRDYIE    : 1;    //!< HSI Ready Interrupt Enable
    u32 LSERDYIE    : 1;    //!< LSE Ready Interrupt Enable
    u32 LSIRDYIE    : 1;    //!< LSI Ready Interrupt Enable
    u32             : 9;
} STRUCT_REGISTER_END GCIR_reg;
STRUCT_SIZE_ASSERT(GCIR_reg, 4);

// PLLCFGR
STRUCT_REGISTER_START {
    u32             : 21;
    u32 POTD        : 2;    //! PLL Output Clock Divider
    u32 PFBD        : 6;    //! PLL VCO Output Clock Feedback Divider
    u32             : 3;
} STRUCT_REGISTER_END PLLCFGR_reg;
STRUCT_SIZE_ASSERT(PLLCFGR_reg, 4);

// PLLCR
STRUCT_REGISTER_START {
    u32             : 31;
    u32 PLLBPS      : 1;    //!< PLL Bypass Mode Enable
} STRUCT_REGISTER_END PLLCR_reg;
STRUCT_SIZE_ASSERT(PLLCR_reg, 4);

// AHBCFGR
STRUCT_REGISTER_START {
    u32 AHBPRE      : 2;    //!< AHB Pre-Scaler
    u32             : 30;
} STRUCT_REGISTER_END AHBCFGR_reg;
STRUCT_SIZE_ASSERT(AHBCFGR_reg, 4);

// AHBCCR
STRUCT_REGISTER_START {
    u32 FMCEN       : 1;    //!< Flash Memory Controller Clock Enable
    u32             : 1;
    u32 SRAMEN      : 1;    //!< SRAM Clock Enable Clock Enable
    u32             : 1;
    u32 PDMAEN      : 1;    //!< Peripheral DMA Clock Enable
    u32 BMEN        : 1;    //!< Bus Matrix Clock Enable
    u32 APB0EN      : 1;    //!< APB0 Bridge Clock Enable
    u32 APB1EN      : 1;    //!< APB1 Bridge Clock Enable
    u32             : 2;
    u32 USBEN       : 1;    //!< USB Clock Enable
    u32 CKREFEN     : 1;    //!< CK_REF Clock Enable
    u32 EBIEN       : 1;    //!< EBI Clock Enable
    u32 CRCEN       : 1;    //!< CRC Clock Enable
    u32             : 2;
    u32 PAEN        : 1;    //!< GPIO Port A Clock Enable
    u32 PBEN        : 1;    //!< GPIO Port B Clock Enable
    u32 PCEN        : 1;    //!< GPIO Port C Clock Enable
    u32 PDEN        : 1;    //!< GPIO Port D Clock Enable
    u32 PEEN        : 1;    //!< GPIO Port E Clock Enable
    u32             : 11;
} STRUCT_REGISTER_END AHBCCR_reg;
STRUCT_SIZE_ASSERT(AHBCCR_reg, 4);

// APBCFGR
STRUCT_REGISTER_START {
    u32             : 16;
    u32 ADCDIV      : 3;    //!< A/D Converter Clock Frequency Division Selection
    u32             : 13;
} STRUCT_REGISTER_END APBCFGR_reg;
