wwng2333/ChibiOS-Contrib/os/common/ext/CMSIS/HT32F165x/ht32f1655_reg.h
STRUCT_SIZE_ASSERT(APBPRSTR0_reg, 4);

STRUCT_REGISTER_START {
    u32 MCTM0RST    : 1;    //!< MCTM 0 Reset Control
    u32 MCTM1RST    : 1;    //!< MCTM 1 Reset Control
    u32             : 2;
    u32 WDTRST      : 1;    //!< Watchdog Reset Control
    u32             : 3;
    u32 GPTM0RST    : 1;    //!< GPTM 0 Reset Control
    u32 GPTM1RST    : 1;    //!< GPTM 1 Reset Control
    u32             : 6;
    u32 BFTM0RST    : 1;    //!< BFTM 0 Reset Control
    u32 BFTM1RST    : 1;    //!< BFTM 1 Reset Control
    u32             : 4;
    u32 OPA0RST     : 1;    //!< Comparator and OPA 0 Controller Reset Control
    u32 OPA1RST     : 1;    //!< Comparator and OPA 1 Controller Reset Control
    u32 ADCRST      : 1;    //!< A/D Converter Reset Control
    u32             : 7;
} STRUCT_REGISTER_END APBPRSTR1_reg;
STRUCT_SIZE_ASSERT(APBPRSTR1_reg, 4);

typedef struct {
    u8 _pad1[0x100];
    GPSR_reg GPSR;              //!< Global Reset Status
    AHBPRSTR_reg AHBPRSTR;      //!< AHB Peripheral Reset
    APBPRSTR0_reg APBPRSTR0;    //!< APB Peripheral Reset 0
    APBPRSTR1_reg APBPRSTR1;    //!< APB Peripheral Reset 1
} RSTCU_map;
STRUCT_SIZE_ASSERT(RSTCU_map, 0x110);

//#define REG_RSTCU ((volatile RSTCU_map *)RSTCU_BASE)

//STRUCT_REG_CHECK(RSTCU, GPSR);
//STRUCT_REG_CHECK(RSTCU, AHBPRSTR);
//STRUCT_REG_CHECK(RSTCU, APBPRSTR0);
//STRUCT_REG_CHECK(RSTCU, APBPRSTR1);

// General Purpose I/O
// ////////////////////////////////////////////////////////////////////////////////////////////////
#define GPIOn_BASE(n)   GPIO_A_BASE + (n * 0x2000)

#define GPIOn_PnDIRCR(n)    GPIOn_BASE(n) + 0x0     // Port n Data Direction Control
#define GPIOn_PnINER(n)     GPIOn_BASE(n) + 0x4     // Port n Input Function Enable Control
#define GPIOn_PnPUR(n)      GPIOn_BASE(n) + 0x8     // Port n Pull-Up Selection
#define GPIOn_PnPDR(n)      GPIOn_BASE(n) + 0xC     // Port n Pull-Down Selection
#define GPIOn_PnODR(n)      GPIOn_BASE(n) + 0x10    // Port n Open Drain Selection
#define GPIOn_PnDRVR(n)     GPIOn_BASE(n) + 0x14    // Port n Drive Current Selection
#define GPIOn_PnLOCKR(n)    GPIOn_BASE(n) + 0x18    // Port n Lock
#define GPIOn_PnDINR(n)     GPIOn_BASE(n) + 0x1C    // Port n Data Input
#define GPIOn_PnDOUTR(n)    GPIOn_BASE(n) + 0x20    // Port n Data Output
#define GPIOn_PnSRR(n)      GPIOn_BASE(n) + 0x24    // Port n Output Set and Reset Control
#define GPIOn_PnRR(n)       GPIOn_BASE(n) + 0x28    // Port n Output Reset Control

// Alternate Function I/O Unit
// ////////////////////////////////////////////////////////////////////////////////////////////////
#define AFIO_ESSR0      AFIO_BASE + 0x0
#define AFIO_ESSR1      AFIO_BASE + 0x4

#define AFIO_GPxCFGLR(n)    AFIO_BASE + 0x20 + (n * 0x8)    // GPIO Port n Configuration 0
#define AFIO_GPxCFGHR(n)    AFIO_BASE + 0x24 + (n * 0x8)    // GPIO Port n Configuration 1

#define AFIO_GPACFGLR   AFIO_GPxCFGLR(GPIO_A)
#define AFIO_GPACFGHR   AFIO_GPxCFGHR(GPIO_A)

#define AFIO_GPBCFGLR   AFIO_GPxCFGLR(GPIO_B)
#define AFIO_GPBCFGHR   AFIO_GPxCFGHR(GPIO_B)

#define AFIO_GPCCFGLR   AFIO_GPxCFGLR(GPIO_C)
#define AFIO_GPCCFGHR   AFIO_GPxCFGHR(GPIO_C)

#define AFIO_GPDCFGLR   AFIO_GPxCFGLR(GPIO_D)
#define AFIO_GPDCFGHR   AFIO_GPxCFGHR(GPIO_D)

#define AFIO_GPECFGLR   AFIO_GPxCFGLR(GPIO_E)
#define AFIO_GPECFGHR   AFIO_GPxCFGHR(GPIO_E)

// ESSR0
STRUCT_REGISTER_START {
    u32 EXTI0PIN    : 4;    //!< EXTI0 Pin Selection
    u32 EXTI1PIN    : 4;    //!< EXTI1 Pin Selection
    u32 EXTI2PIN    : 4;    //!< EXTI2 Pin Selection
    u32 EXTI3PIN    : 4;    //!< EXTI3 Pin Selection
    u32 EXTI4PIN    : 4;    //!< EXTI4 Pin Selection
    u32 EXTI5PIN    : 4;    //!< EXTI5 Pin Selection
    u32 EXTI6PIN    : 4;    //!< EXTI6 Pin Selection
    u32 EXTI7PIN    : 4;    //!< EXTI7 Pin Selection
} STRUCT_REGISTER_END ESSR0_reg;
STRUCT_SIZE_ASSERT(ESSR0_reg, 4);

// ESSR1
STRUCT_REGISTER_START {
    u32 EXTI8PIN    : 4;    //!< EXTI8 Pin Selection
    u32 EXTI9PIN    : 4;    //!< EXTI9 Pin Selection
    u32 EXTI10PIN   : 4;    //!< EXTI10 Pin Selection
    u32 EXTI11PIN   : 4;    //!< EXTI11 Pin Selection
    u32 EXTI12PIN   : 4;    //!< EXTI12 Pin Selection
    u32 EXTI13PIN   : 4;    //!< EXTI13 Pin Selection
    u32 EXTI14PIN   : 4;    //!< EXTI14 Pin Selection
    u32 EXTI15PIN   : 4;    //!< EXTI15 Pin Selection
} STRUCT_REGISTER_END ESSR1_reg;
STRUCT_SIZE_ASSERT(ESSR1_reg, 4);

// GPxCFGLR
STRUCT_REGISTER_START {
    u32 PxCFG0      : 4;    //!< Alternate Function Select for Port x Pin 0
    u32 PxCFG1      : 4;    //!< Alternate Function Select for Port x Pin 1
    u32 PxCFG2      : 4;    //!< Alternate Function Select for Port x Pin 2
    u32 PxCFG3      : 4;    //!< Alternate Function Select for Port x Pin 3
    u32 PxCFG4      : 4;    //!< Alternate Function Select for Port x Pin 4
    u32 PxCFG5      : 4;    //!< Alternate Function Select for Port x Pin 5
    u32 PxCFG6      : 4;    //!< Alternate Function Select for Port x Pin 6
    u32 PxCFG7      : 4;    //!< Alternate Function Select for Port x Pin 7
} STRUCT_REGISTER_END GPxCFGLR_reg;
STRUCT_SIZE_ASSERT(GPxCFGLR_reg, 4);

// GPxCFGHR
STRUCT_REGISTER_START {
    u32 PxCFG8      : 4;    //!< Alternate Function Select for Port x Pin 8
    u32 PxCFG9      : 4;    //!< Alternate Function Select for Port x Pin 9
    u32 PxCFG10     : 4;    //!< Alternate Function Select for Port x Pin 10
    u32 PxCFG11     : 4;    //!< Alternate Function Select for Port x Pin 11
    u32 PxCFG12     : 4;    //!< Alternate Function Select for Port x Pin 12
    u32 PxCFG13     : 4;    //!< Alternate Function Select for Port x Pin 13
    u32 PxCFG14     : 4;    //!< Alternate Function Select for Port x Pin 14
    u32 PxCFG15     : 4;    //!< Alternate Function Select for Port x Pin 15
} STRUCT_REGISTER_END GPxCFGHR_reg;
STRUCT_SIZE_ASSERT(GPxCFGHR_reg, 4);

typedef struct {
    ESSR0_reg ESSR0;
    ESSR1_reg ESSR1;
    u8 _pad1[0x18];

    union {
        struct {
            GPxCFGLR_reg GPACFGLR;
            GPxCFGHR_reg GPACFGHR;

