wwng2333/ChibiOS-Contrib/os/common/ext/CMSIS/HT32F165x/ht32f1655_reg.h
            GPxCFGLR_reg GPBCFGLR;
            GPxCFGHR_reg GPBCFGHR;

            GPxCFGLR_reg GPCCFGLR;
            GPxCFGHR_reg GPCCFGHR;

            GPxCFGLR_reg GPDCFGLR;
            GPxCFGHR_reg GPDCFGHR;

            GPxCFGLR_reg GPECFGLR;
            GPxCFGHR_reg GPECFGHR;
        };
        
        struct {
            GPxCFGLR_reg LR;
            GPxCFGHR_reg HR;
        } GPnCFG[5];
    };
} AFIO_map;
STRUCT_SIZE_ASSERT(AFIO_map, 0x48);

//#define REG_AFIO ((volatile AFIO_map *)AFIO_BASE)

//STRUCT_REG_CHECK(AFIO, ESSR0);
//STRUCT_REG_CHECK(AFIO, ESSR1);
//STRUCT_REG_CHECK(AFIO, GPACFGLR);
//STRUCT_REG_CHECK(AFIO, GPACFGHR);
//STRUCT_REG_CHECK(AFIO, GPBCFGLR);
//STRUCT_REG_CHECK(AFIO, GPBCFGHR);
//STRUCT_REG_CHECK(AFIO, GPCCFGLR);
//STRUCT_REG_CHECK(AFIO, GPCCFGHR);
//STRUCT_REG_CHECK(AFIO, GPDCFGLR);
//STRUCT_REG_CHECK(AFIO, GPDCFGHR);
//STRUCT_REG_CHECK(AFIO, GPECFGLR);
//STRUCT_REG_CHECK(AFIO, GPECFGHR);

// SPI
// ////////////////////////////////////////////////////////////////////////////////////////////////
#define SPI_SPICR0      SPI0_BASE + 0x0     // SPI Control Register 0
#define SPI_SPICR1      SPI0_BASE + 0x4     // SPI Control Register 1
#define SPI_SPIIER      SPI0_BASE + 0x8     // SPI Interrupt Enable Register
#define SPI_SPICPR      SPI0_BASE + 0xC     // SPI Clock Prescaler Register
#define SPI_SPIDR       SPI0_BASE + 0x10    // SPI Data Register
#define SPI_SPISR       SPI0_BASE + 0x14    // SPI Status Register
#define SPI_SPIFCR      SPI0_BASE + 0x18    // SPI FIFI Control Register
#define SPI_SPIFSR      SPI0_BASE + 0x1C    // SPI FIFO Status Register
#define SPI_SPIFTOCR    SPI0_BASE + 0x20    // SPI FIFO Time Out Register

// SPICR0
STRUCT_REGISTER_START {
    u32 SPIEN   : 1;    //!< SPI Enable
    u32 TXDMAE  : 1;    //!< TX PDMA Request Enable
    u32 RXDMAE  : 1;    //!< RX PDMA Request Enable
    u32 SELOEN  : 1;    //!< Slave Select Output Enable
    u32 SSELC   : 1;    //!< Software Slave Select Control
    u32         : 1;
    u32 DUALEN  : 1;    //!< Dual Port Enable
    u32 GUADTEN : 1;    //!< Guard Time Enable
    u32 GUADT   : 4;    //!< Guard Time
    u32 SELHT   : 4;    //!< Chip Select Hold Time
    u32         : 16;
} STRUCT_REGISTER_END SPICR0_reg;
STRUCT_SIZE_ASSERT(SPICR0_reg, 4);

// SPICR1
STRUCT_REGISTER_START {
    u32 DFL         : 4;    //!< Data Frame Length
    u32             : 4;
    u32 FORMAT      : 3;    //!< SPI Data Transfer Format
    u32 SELAP       : 1;    //!< Slave Select Active Priority
    u32 FIRSTBIT    : 1;    //!< LSB or MSB Transmitted First
    u32 SELM        : 1;    //!< Slave Select Mode
    u32 MODE        : 1;    //!< Master or Slave Mode
    u32             : 17;
} STRUCT_REGISTER_END SPICR1_reg;
STRUCT_SIZE_ASSERT(SPICR1_reg, 4);

// SPIIER
STRUCT_REGISTER_START {
    u32 TXBEIEN     : 1;    //!< TX Buffer Empty Interrupt Enable
    u32 TXEIEN      : 1;    //!< TX Empty Interrupt Enable
    u32 RXBNEIEN    : 1;    //!< RX Buffer Not Empty Interrupt Enable
    u32 WCIEN       : 1;    //!< Write Collison Interrupt Enable
    u32 ROIEN       : 1;    //!< Read Overrun Interrupt Enable
    u32 MFIEN       : 1;    //!< Mode Fault Interrupt Enable
    u32 SAIEN       : 1;    //!< Slave Abort Interrupt Enable
    u32 TOIEN       : 1;    //!< Time Out Interrupt Enable
    u32             : 24;
} STRUCT_REGISTER_END SPIIER_reg;
STRUCT_SIZE_ASSERT(SPIIER_reg, 4);

// SPICPR
STRUCT_REGISTER_START {
    u32 CP  : 16;    //!< SPI Clock Prescaler
    u32     : 16;
} STRUCT_REGISTER_END SPICPR_reg;
STRUCT_SIZE_ASSERT(SPICPR_reg, 4);

// SPIDR
STRUCT_REGISTER_START {
    u32 DR  : 16;    //!< Data Register
    u32     : 16;
} STRUCT_REGISTER_END SPIDR_reg;
STRUCT_SIZE_ASSERT(SPIDR_reg, 4);

// SPISR
STRUCT_REGISTER_START {
    const u32 TXBE  : 1;    //!< Transmit Buffer Empty Flag
    const u32 TXE   : 1;    //!< Transmission Register Empty Flag
    const u32 RXBNE : 1;    //!< Receive Buffer Not Empty Flag
    u32 WC          : 1;    //!< Write Collision Flag
    u32 RO          : 1;    //!< Read Overrun Flag
    u32 MF          : 1;    //!< Mode Fault Flag
    u32 SA          : 1;    //!< Slave Abort Flag
    u32 TO          : 1;    //!< Time Out Flag
    const u32 BUSY  : 1;    //!< SPI Busy Flag
    u32             : 23;
} STRUCT_REGISTER_END SPISR_reg;
STRUCT_SIZE_ASSERT(SPISR_reg, 4);

// SPIFCR
STRUCT_REGISTER_START {
    u32 TXFTLS  : 4;    //!< TX FIFO Trigger Level Select
    u32 RXFTLS  : 4;    //!< RX FIFO Trigger Level Select
    u32         : 2;
    u32 FIFOEN  : 1;    //!< FIFO Enable
    u32         : 21;
} STRUCT_REGISTER_END SPIFCR_reg;
STRUCT_SIZE_ASSERT(SPIFCR_reg, 4);

// SPIFSR
STRUCT_REGISTER_START {
    u32 TXFS    : 4;    //!< TX FIFO Status
    u32 RXFS    : 4;    //!< RX FIFO Status
    u32         : 24;
} STRUCT_REGISTER_END SPIFSR_reg;
STRUCT_SIZE_ASSERT(SPIFSR_reg, 4);

// SPIFTOCR
STRUCT_REGISTER_START {
    u32 TOC     : 32;    //!< Time Out Counter
} STRUCT_REGISTER_END SPIFTOCR_reg;
STRUCT_SIZE_ASSERT(SPIFTOCR_reg, 4);

typedef struct {
    SPICR0_reg SPICR0;
    SPICR1_reg SPICR1;
    SPIIER_reg SPIIER;
    SPICPR_reg SPICPR;
    SPIDR_reg SPIDR;
    SPISR_reg SPISR;
    SPIFCR_reg SPIFCR;
    SPIFSR_reg SPIFSR;
    SPIFTOCR_reg SPIFTOCR;
} SPI_map;
STRUCT_SIZE_ASSERT(SPI_map, 0x24);

//#define REG_SPI0 ((volatile SPI_map *)SPI0_BASE)
//#define REG_SPI1 ((volatile SPI_map *)SPI1_BASE)

//STRUCT_ADDR_ASSERT(REG_SPI0->SPICR0, SPI_SPICR0);
//STRUCT_ADDR_ASSERT(REG_SPI0->SPICR1, SPI_SPICR1);
//STRUCT_ADDR_ASSERT(REG_SPI0->SPIIER, SPI_SPIIER);
//STRUCT_ADDR_ASSERT(REG_SPI0->SPICPR, SPI_SPICPR);
//STRUCT_ADDR_ASSERT(REG_SPI0->SPIDR, SPI_SPIDR);
//STRUCT_ADDR_ASSERT(REG_SPI0->SPISR, SPI_SPISR);
//STRUCT_ADDR_ASSERT(REG_SPI0->SPIFCR, SPI_SPIFCR);
//STRUCT_ADDR_ASSERT(REG_SPI0->SPIFSR, SPI_SPIFSR);
//STRUCT_ADDR_ASSERT(REG_SPI0->SPIFTOCR, SPI_SPIFTOCR);

#endif // HT32F1655_H
